Revit 2015 API
RevisionNumberType Enumeration
 Determines how a particular revision will be numbered.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2015
Since: 2015
Syntax
C#
public enum RevisionNumberType
Visual Basic
Public Enumeration RevisionNumberType
Visual C++
public enum class RevisionNumberType
Members
Member name | Description
Numeric |  The Revision Number will be a number.
Alphabetic |  The Revision Number will be a string generated from the revision alphabet in the document.
None |  No Revision Number will be assigned.
See Also
Autodesk.Revit.DB Namespace